Revit 2027 API
RebarShapeArcReferenceType Enumeration
 A Rebar Shape Definition constraint that is measured to a bend must take the bar diameter into account by specifying whether it measures to the exterior, centerline, or interior of the bend.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum RebarShapeArcReferenceType
Public Enumeration RebarShapeArcReferenceType
public enum class RebarShapeArcReferenceType
type RebarShapeArcReferenceType
Members
Member name | Value | Description
Centerline | 0 |  Measure to the centerline of the bar.
External | 1 |  Measure to the exterior of the bend.
Internal | -1 |  Measure to the interior of the bend.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace